#Логические переменные
t = True
f = False
#Логические значения можно получать и как возвращаемое значение некоторых действий, таких как сравнение:
print(3 > 10)
# False

print(3 < 10)
# True

print(3 == 10) # равны ли объекты?
# False

#Можно также проверить, содержится ли какой-то символ в строке:
print('r' in 'world') # проверяем отдельный символ
# True

print('th' in 'python') # проверяем целую подстроку
# True

print('the' in 'python')
# False
print()
print()
#Задание 12.2.9 Истинно (True) или ложно (False) высказывание?
print(1.57*3/1.5 == 3.14)  #true
print('PY' in "Python") #False
