#Числа с плавающей точкой
x = 0.1
y = 21.5

print(type(x))
# <class 'float'>
print(type(y))
# <class 'float'>
#С числами с плавающей точкой можно производить уже все знакомые операции, в том числе и деление:
z = y / x
print(z)
print(type(z))
# 215.0
# <class 'float'>

#Задание 12.2.4 Что распечатает функция print()? Попробуйте решить это задание без применения IDE,
# затем можете проверить свой результат путём запуска такой программы.
print (0.1+0.1*5-0.3*4)
#-0.6

#Задание 12.2.5 Что распечатает функция print()? Попробуйте решить это задание без применения IDE,
# затем можете проверить свой результат путём запуска такой программы.
print ((3.14+0.3)/2+0.15)
#1.87