#12.1 переменные
#Начнём с того, что научимся записывать данные в переменную. Это действие можно выполнить с помощью команды:
animal = "panda"
#Строго говоря, название переменной может быть абсолютно любым:
vnfjivndfjn = "other_value"
#Существует два главных правила именования переменных:
#Название переменной должно состоять только из букв, цифр и знаков подчеркивания _.
#Название переменной не должно начинаться с цифры.

# возможность так называемого множественного присваивания.
# В одной строке можно присвоить значение сразу нескольким переменным:
a, b = "some_string_a", "some_string_b"
#Благодаря такой возможности становится удобным обмен значений двух переменных.
temp = a # сохранили в temp старое значение a
a = b # в переменную a сохранили значение b
b = temp # а в переменную b вернули сохраненное значение a
#Множественное присваивание позволяет записать это действие в одной строке:
a, b = b, a

#Ввод с консоли, input()
text = input()
# пользователю предлагается ввести данные
# после нажатия Enter они сохранятся в переменную text
name = input("Введите ваше имя:")
# Введите ваше имя:
# После ввода текста с клавиатуры и нажатия Enter,
# имя сохранится в переменную name

#Вывод в консоль, print()
print("Hello, world!")
# Hello, world!
print(3.14159)
# 3.14159

#Более того, можно выводить в консоль сразу и текст, и числа. Для этого вводимые данные разделяются запятыми.
# По умолчанию функция print() автоматически ставит пробел между аргументами:
print("Ответ на главный вопрос жизни, вселенной и всего такого -", 42)
# Ответ на главный вопрос жизни, вселенной и всего такого - 42

month = input ("Какой сейчас месяц?")

print ("Текущий месяц -", month)

# Вставьте правильное название функции вместо ???
def which_month():
    month = input("Which month is it now?")
    print("Current month is", month)


if __name__ == '__main__':
    which_month()
#Практический пример
first_name = input("Введите ваше имя:")
last_name = input("Введите вашу фамилию:")
age = input("Введите ваш возраст:")
city = input("Введите город проживания:")

#Скопируй следующий код и запусти его!

first_name = input("Введите ваше имя:")
last_name = input("Введите вашу фамилию:")
age = input("Введите ваш возраст:")
city = input("Введите город проживания:")

# Выводим пустую строку
print("")

# Выводим приветствие, подставляя имя и фамилию пользователя,
# которые он ввел с клавиатуры
print("Привет,", first_name, last_name, "!")

# Выводим пустую строку
print("")

# Выводим фиксированный текст для удобства просмотра
print("Ваш профиль:")

# Выводим возраст и город, которые указал пользователь
print("Возраст:", age)
print("Город:", city)
#Сравни результаты работы своей программы с выводом, представленным ниже.
#ведите ваше имя: Иван
#ведите вашу фамилию: Петров
#ведите ваш возраст: 25
#ведите город проживания: Москва

#ривет, Иван Петров!

#аш профиль:
#озраст: 25
#ород: Москва



