#Целые числа
#Множество целых чисел
a = 5/2
print(a)
# 2.5
#Операция целочисленного деления
# // возвращает целую часть получившегося результата, отбрасывая всю дробную часть. Приведём несколько примеров:
print(1 // 3)
# 0
print(3 // 3)
# 1
print(29 // 3)
# 9
#об остатке от деления
print(1 % 3) # ближайшее число, которое нацело делится на 3 - это ноль
# 1
print(3 % 3) # в этом примере сам делитель может нацело разделиться
# 0
print(29 % 3) # здесь ближайшее число - 27, и поэтому результат 29-27=2
# 2
#от деления в случае отрицательных чисел.
a = 5
b = 2
q = a // b # q = 2
r = a % b  # r = 1
#Посмотрим на несколько другую ситуацию:
a = -5
b = 2
q = a // b # хочется получить 2, как и в прошлый раз, но q = -3
r = a % b # а остаток остался тот же r = 1
#Задание 12.3.1 Что получится в результате вычислений?
print ((31 % 2) + (-31 % 2))#2
print (13 % -3 * 3 - 3**2)#-15
