#Длинная арифметика
f = 653457
g = 123493
print(f**g)
# 393354..282257

#Числа с плавающей точкой
#Десятичная форма
a = 5.4321
print(a)
# 5.4321
#экспоненциальная форма
print(a**100)
# 3.138886636534116e+73

a = 5.4321**100 # 3.138886636534116e+73

print(a*100) # мантисса осталась прежней, а степень увеличилась на 2
# 3.138886636534116e+75

print(a*1000) # аналогично, только степень увеличилась уже на 3
# 3.138886636534116e+76

print(a/100) # снова мантисса не меняется, а степень уже уменьшилась
# 3.138886636534116e+71

print(a/1000) # как, наверное, уже ожидаемо, степень снова уменьшилась
# 3.138886636534116e+70

# 3.138886636534116e+73 - изначально
# 313.8886636534116e+73 - при умножении на 100
# 3138.886636534116e+73 - при умножении на 1000
# 0.03138886636534116e+73 - при делении на 100
# 0.003138886636534116e+73 - при делении на 1000

#Рассмотрим такой пример:
print(1/3)
# 0.3333333333333333
print(1.3+2.3)
# 3.5999999999999996