#Преобразование типов
#int для целых чисел,
#float для чисел с плавающей точкой.
print(3/2)
# 1.5
print(3.14*2)
# 6.28
#В данном выражении var — это объект, который подлежит преобразованию,
# а t — это тип (int или float), к которому необходимо преобразовать. Рассмотрим на примерах:
print(float(1))
# 1.0
print(int(3.14))
# 3
print(int(2.8)) # ожидается 3, т.к. 2.8>2.5
# 2
print(1.00+0.01-3.01) # ожидается -2.0
# -1.9999999999999998
print(int(1.00+0.01-3.01))
# -1
# необходимо пользоваться функцией round():
print(round(1.00+0.01-3.01))
# -2
print(3.14/2)
# 1.57
print(round(3.14/2, 1)) # второй аргумент - желаемое количество знаков
# 1.6
