#Задание 13.4.8

#Создайте скрипт, который будет в input() принимать строки, их необходимо будет конвертировать в числа, добавьте
# try-except, чтобы строки могли быть сконвертированы в числа.
#
#В случае удачного выполнения скрипта пусть выведется: «Вы ввели правильное число».
#
#В конце скрипта обязательно должна быть надпись «Выход из программы».
#
#ПРИМЕЧАНИЕ: Для отлова ошибок используйте try-except, а также блоки finally и else.
#
#Примеры входов и выходов:

#1 	-   Вы ввели 1  -   Выход из программы
#-3 	-   Вы ввели -3  -   Выход из программы
#razdvatri  -   вы ввели неправильное число     -   Выход из программы

print("Начало программы:")
try:
    numbers = int(input("Введите число:\t"))
except ValueError as e:
    print("Вы ввели не правильное число")
else:
    print(f'Вы ввели {numbers}')
finally:
    print("Выход из программы!")


