#Напишите программу, которая на вход принимает текст и выводит количество уникальных символов.

a = input("Введите текст:")
a = set(a)
print(("Количество уникальных символов в тексте:"),len(a))
