#Напишите программу, которая на вход получает последовательность чисел, а выводит модифицированный список:

#1)Первое и последнее числа последовательности должны поменяться местами.
#2)В конец списка нужно добавить сумму всех чисел.

n_str = input("Введите числа через пробел:")
list_n_str = n_str.split()
list_n_int = list(map(float, list_n_str))
list_n_int[0], list_n_int[-1] = list_n_int[-1], list_n_int[0]
list_n_int.append(sum(list_n_int))
print(list_n_int)

#С подсказкой :
# все операции - деление строки по пробелам, преобразование к числам
# и приведение объекта map к типу список, можно делать в одной строке
#L = list(map(float, input().split()))

# обмениваем первое и последнее число
# с помощью множественного присваивания
#L[0], L[-1] = L[-1], L[0]

# находим сумму и добавляем её в конец списка
#L.append(sum(L))

#print(L)

n_int = list(map(float, input().split()))
n_int[0],n_int[-1] = n_int[-1], n_int[0]
n_int.append(sum(n_int))
print(n_int)