#Задание 13.6.4

#Напишите цикл с использованием whilе, который возводит числа в квадрат, пока результат меньше 1000.


n = 1

while n ** 2 < 1000:
    n += 1
    print("Еще считаю...")
print("Кол-во чисел:", n)

s = 32 ** 2
print(s)

#При самостоятельном выполнении зациклил на бесконечность
#s=1
#n=1
# while s < 1000:
#    s ** 2
#    print(s) #примерно так(чуть иначе)